# -*- org-export-with-section-numbers: t; org-latex-reference-command: "\\ref{%s}"; -*-
#+title: Disentangling Concepts and Constructing Human-Compatible Explanations for Image Embeddings
#+author: Romeo Valentin and others
#+date: Spring 2024
#+email: romeov@stanford.edu
#+bibliography: /home/romeo/Zotero/zotero-bibliography.bib
#+cite_export: csl
#+options: toc:2 todo:nil
# #+options: toc:nil todo:nil
#+latex_header: \usepackage{mathtools}
#+latex_header_extra: \usepackage{iclr2021_conference,times}  % putting this in the org mode header makes all snippets render wrong...
#+latex_header_extra: \iclrfinalcopy
# #+latex_header_extra: \affil{Department of Aeronautics and Astronautics, Stanford University}

#+begin_abstract
Vision Transformers produce high-quality embeddings useful for a variety of downstream tasks -- although both their embeddings and inner workings are typically difficult to interpret.
By disentangling the conceptual components of the data we can hope to gain additional insight.
Finding such disentangled human-aligned conceptual components has been shown to be difficult in the past.
In this work we propose using the K-SVD algorithm together with captioned image datasets to disentangle the final embeddings and assign human-compatible "explanations" for each of the disentangled "concepts".
To achieve this, we present a new highly optimized implementation of the K-SVD algorithm that scales to large datasets with millions of samples and can be scaled to many compute nodes.
We find that we can successfully cluster images by their active concepts and that the explanations hold up to visual inspection, but that it is difficult to quantitatively measure the quality of the explanations.
#+end_abstract


* TODOs :noexport:
:LOGBOOK:
CLOCK: [2024-04-21 Sun 19:52]--[2024-04-21 Sun 20:17] =>  0:25
CLOCK: [2024-04-21 Sun 16:40]--[2024-04-21 Sun 17:05] =>  0:25
CLOCK: <2024-04-21 Sun 15:50>--<2024-04-21 Sun 16:15> =>  0:25
CLOCK: [2024-04-21 Sun 14:58]--[2024-04-21 Sun 15:23] =>  0:25
CLOCK: [2024-04-21 Sun 14:27]--[2024-04-21 Sun 14:52] =>  0:25
:END:
- [X] go through previous document and current document, decide what to keep and what to throw
- [ ] proof read and throw out some unrelated stuff.
- [ ] maybe factor our KSVD.jl discussion
- [ ] Generate a bunch more visualization examples




